Repository: tanyashybko/Valid_email
Catalog: valid_email/lib/l10n/arb/app_*.arb
Languages: ru

# appTitle
source: Flutter Input Example
ru: Пример ввода Flutter

# inputExampleScreenTitle
source: Input Example
ru: Пример ввода

source: Valid input
ru: Правильный ввод

# invalidCharacters
source: Invalid characters in input
ru: Недопустимые символы вводимых данных

source: Unexpected error
ru: Неожиданная ошибка

# enterEmailLabelText
source: Enter your e-mail
ru: Введите свой e-mail

# invalidEmailMessage
source: Invalid email
ru: Неверный email

# enterYourEmailMessage
source: Please enter your email
ru: Пожалуйста, введите свой email

# mustContainAtSign
source: You email must contain @ sign
ru: Ваш e-mail должен содержать знак @

# enterPhoneLabelText
source: Enter your phone number
ru: Введите свой номер телефона

# invalidPhoneMessage
source: Invalid phone number
ru: Неверный номер телефона

# mustContainPlusSign
source: Phone number must contain "+"
ru: Номер телефона должен содержать "+"

# tooLongNumber
source: Phone number is too long
ru: Слишком длинный телефонный номер

# tooShortNumber
source: Phone number is too short
ru: Слишком короткий телефонный номер

# layoutTitle
source: Two layouts
ru: Два макета

# largeSmallTitle
source: The third layout
ru: Третий макет

# firstWidget
source: The first widget
ru: Первый виджет

# fourthWidget
source: The fourth widget
ru: Четвёртый виджет

# layoutPage
source: Open the second page
ru: Открыть вторую страницу

# layoutThirdPage
source: Open the third page
ru: Открыть третью страницу
